import React from "react";

const Agreement = () => {
   return (
      <div className="m-2">
         <div class="flex min-h-screen items-center justify-start">
            <div class="mx-auto w-full max-w-2xl">
               <h1 class="text-4xl font-medium text-center">
                  Пользовательское соглашение
               </h1>
               <p class="mt-3">
                  <span className="block font-bold">
                     Пользовательское соглашение для платформы по отслеживанию и
                     улучшению ментального состояния
                  </span>
                  Добро пожаловать на платформу по отслеживанию и улучшению
                  ментального состояния Quicsence, которая разработана для
                  помощи пользователям в улучшении и поддержании своего
                  ментального состояния.
               </p>
               <p>
                  <span className="block font-bold">
                     Права на интеллектуальную собственность.
                  </span>
                  Все материалы и содержимое Платформы, включая, но не
                  ограничиваясь, тексты, изображения, видео, графику, коды и
                  программное обеспечение, являются собственностью нашей
                  компании или ее партнеров. Вы не имеете права копировать,
                  распространять, изменять или использовать содержимое Платформы
                  без нашего разрешения.
               </p>
               <p>
                  <span className="block font-bold">
                     Ограничения ответственности.
                  </span>
                  Пользователь полностью осознает и принимает на себя всю
                  ответственность за использование Платформы и любых материалов,
                  доступных на Платформе. Мы не несем ответственности за любые
                  неправильные действия или решения, которые может принимать
                  пользователь, основываясь на информации или рекомендациях,
                  представленных на Платформе.
               </p>
               <p>
                  <span className="block font-bold">Конфиденциальность.</span>
                  Мы уважаем конфиденциальность наших пользователей и обязуемся
                  защищать их личную информацию в соответствии с нашей политикой
                  конфиденциальности. Мы не будем делиться или передавать вашу
                  личную информацию третьим лицам без вашего явного согласия, за
                  исключением случаев, предусмотренных законодательством.
               </p>
               <p>
                  <span className="block font-bold">
                     Отказ от ответственности.
                  </span>
                  Мы не можем гарантировать точность, полноту или актуальность
                  информации, представленной на Платформе, и не несем
                  ответственности за любые ошибки или упущения в этой
                  информации. Мы также не несем ответственности за любые
                  проблемы, возникающие из-за неполадок в работе Платформы или
                  любых связанных с ней систем.
               </p>
               <p>
                  <span className="block font-bold">
                     Изменения пользовательского соглашения.
                  </span>
                  Мы оставляем за собой право изменять это пользовательское
                  соглашение в любое время без предварительного уведомления.
                  Пользователи обязаны регулярно проверять это соглашение на
                  наличие изменений и соблюдать его последнюю версию.
               </p>
               <p>
                  <span className="block font-bold">Заключение.</span> Используя
                  Платформу, вы соглашаетесь с этим пользовательским соглашением
                  и обязуетесь следовать его условиям. Если вы не согласны с
                  каким-либо из условий, вы не можете использовать Платформу.
               </p>
            </div>
         </div>
      </div>
   );
};

export default Agreement;
